Tekla Open API Reference for Tekla Structures 2025
BaseLinePlacing Methods
The BaseLinePlacing type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
BaseLinePlacing Class
Tekla.Structures.Drawing Namespace